In [2]:
import pandas as pd
import numpy as np

In [5]:
fruits=pd.Series([10,6,3],["apples","oranges","bananas"])
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [10]:
print("fruits +2:\n", fruits+2)

fruits +2:
 apples     12
oranges     8
bananas     5
dtype: int64

In [11]:
print('fruits + 2:\n', fruits + 2)

fruits + 2:
 apples     12
oranges     8
bananas     5
dtype: int64

In [12]:
print("exp(fruits):\n", np.exp(fruits))

exp(fruits):
 apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

In [13]:
print("sqrt(fruits):\n", np.sqrt(fruits))

sqrt(fruits):
 apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

In [15]:
print("power(fruits):", np.power(fruits,2))

power(fruits): apples     100
oranges     36
bananas      9
dtype: int64

In [16]:
# Perform arithmentic operation to only an element
print("Add + 2 to bananas:", fruits["bananas"]+2)

Add + 2 to bananas: 5

In [19]:
fruits=pd.Series([2,3,7])
fruits

0    2
1    3
2    7
dtype: int64

In [21]:
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

In [22]:
books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

In [25]:
# Users that have np.nan values means that the user has not yet rated that book.
# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. Let Pandas
# automatically assign numerical row indices to the DataFrame. 

# Create a dictionary with the data given above
dat = {{"Authours":authors,"Book Title":books},{user_1,user_2,user_3,user_4}},
print(dat)

TypeError: 'Series' objects are mutable, thus they cannot be hashed

In [28]:
dat = {"Author":authors,
        "Book Title":books,
        "User 1": user_1,
        "User 2":user_2,
        "User 3":user_3,
        "User 4":user_4}

In [29]:
book_ratings = pd.DataFrame(dat)

In [30]:
book_ratings

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     NaN     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     NaN     4.0
3          H. G. Wells     The Time Machine     NaN     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     NaN     NaN     NaN     4.2